[
  {
    "id": "cadec2018",
    "date": "2018-01-24",
    "time": "13.00 till 17.00 registrering från 12.30",
    "title": "Cadec 2018",
    "title2": "CALLISTA DEVELOPER’S CONFERENCE",
    "address": "Filmstaden Bergakungen, Skånegatan 16 B, Göteborg",
    "latlng": "57.702244,11.986245",
    "afterCadec":
      "Mat, dryck och mingel17.30 - Callistas kontorFabriksgatan 13, Gårda",
    "shortDescription":
      "Cadec 2018 – med de senaste trenderna inom arkitektur och systemutveckling",
    "description":
      "<p>Rivstarta 2018 med ett inspirerande kunskapslyft. Vi har nöjet att bjuda in till en rykande aktuell Cadec med de senaste trenderna inom arkitektur och utveckling - nu i ett större format än någonsin.</p> <p>Nytt för i år är att Cadec Göteborg äger rum på Filmstaden Bergakungen. Där får vi gott om plats för vår ständigt växande publik och hoppas kunna erbjuda en presentationsupplevelse utöver det vanliga.</p><p> Du är också inbjuden till After Cadec - varva ner efter konferensen med mat, dryck och mingel.</p> <p>Konferensen är som vanligt kostnadsfri.</p><p>Antalet platser är begränsat - anmäl dig redan idag för att inte missa denna chans till gratis kompetensutveckling.</p>",
    "talks": {
      "1": {
        "title": "Machine Learning för dig som vill börja koda nu",
        "description":
          "AI, Deep Learning, Machine Learning – begreppen haglar. Vad är skillnaden, och vad behöver jag som mjukvaruutvecklare kunna och förstå för att kunna dra nytta av teknologin? Machine Learning och AI har funnits  i över 30 år, varför är det så hett nu? I detta föredrag försöker vi reda ut begreppen och räta ut frågetecknen. Machine Learning är ett väldigt brett område och kan användas i många tillämpningar - talsyntes, bildigenkänning, ekonomiska förutsägelser och optimering. Det innefattar allt från avancerad matematisk teori till enkla tumregler samt även mer praktiska problemområden som prestanda och testning.Föredraget reder ut de grundläggande koncepten och den teoretiska grunden, samt ger pekare till intressanta områden att fortsätta utbilda sig inom. Vi demonstrerar också hur ett konkret arbetsflöde kan se ut AI-plattformen H2O.",
        "eventId": "cadec2018",
        "id": 1,
        "speakers": [
          {
            "id": 1,
            "avatarUrl":
              "https://api.eventlama.com/avatars/events/74/speakers/734/avatar.png",
            "bio": "Niclas is great!",
            "github": "github",
            "name": "Niklas Antoncic",
            "twitter": "twitter"
          }
        ],
        "startDate": "2018-01-24 13:00:00 +0000 UTC"
      },
      "2": {
        "title":
          "”Open, Evolving, Nimble & Scalable” – är Java redo för microservices?",
        "description":
          "En hel del har hänt sedan förra årets Cadec – Java 9 och Java EE 8 är släppta och på JavaOne talade man om fyra nya ledande principer för Javas utveckling framåt: ”Open, Evolving, Nimble & Scalable”. Har man hittat botemedlet på JVM:ens tillkortakommanden gällande fotavtryck i drift med avseende på minne och uppstartstid? Hur ska innovationstakten inom ekosystemet öka?     Under detta flashföredrag sammanfattar vi det viktigaste som hänt under det gångna året, försöker besvara ovanstående frågor samt tittar praktiskt på om problematiken med JVM:ens fotavtryck kvarstår.",
        "eventId": "cadec2018",
        "id": 2,
        "speakers": [
          {
            "id": 2,
            "avatarUrl":
              "https://api.eventlama.com/avatars/events/74/speakers/734/avatar.png",
            "bio": "Andreas is great!",
            "github": "github",
            "name": "Andreas Tell",
            "twitter": "twitter"
          }
        ],
        "startDate": "2018-01-24 13:00:00 +0000 UTC"
      },
      "3": {
        "title": "Kafka i strömmen – så får du flyt på dina dataflöden",
        "description":
          "Det har nog inte undgått någon att Apache Kafka trendar just nu. Vi fullkomligen bombarderas av artiklar om strömmande arkitektur, event-sourcing och SMACK-stack, för att bara nämna några områden där Apache Kafka spelar en betydande roll.  Nu har även en första major version av Apache Kafka släppts. Tillsammans skall vi reda ut vad en ”distributed commit log” faktiskt är för något. Några av frågorna vi belyser är•Hur fungerar den?  •Vilka fallgropar finns?  •Vad har detta med strömmar att göra? •Och framför allt, varför pratas det så mycket om detta nu? Vi avslutar sedan med att använda våra nyvunna kunskaper för att bygga ett strömmande systemfrån grunden.",
        "eventId": "cadec2018",
        "id": 3,
        "speakers": [
          {
            "id": 3,
            "avatarUrl":
              "https://api.eventlama.com/avatars/events/74/speakers/734/avatar.png",
            "bio": "Torbjörn is great!",
            "github": "github",
            "name": "Torbjörn Claesson",
            "twitter": "twitter"
          }
        ],
        "startDate": "2018-01-24 13:00:00 +0000 UTC"
      },
      "4": {
        "title": "ReactJS – en gemensam design för alla plattformar",
        "description":
          "ReactJS har med sin ansats för att strukturera, testa och resonera kring kod, samt genom sin tonvikt på tillstånd och envägs dataflöden, utvecklats till ett föredöme inom frontend-utveckling. En inte särskilt väl dold hemlighet i ReactJS är förmågan att skapa användargränssnitt på en stor mängd plattformar; webb, mobil (iOS, Android), desktop, terminal (faktiskt) och – något överraskande – hårdvara. Delad kod och gemensamma underliggande modeller/designprinciper bidrar till en verkligt mångsidig utvecklingsmiljö, där ett traditionellt webb/javascript-team kan utveckla mot många olika målmiljöer och plattformar. Vi utforskar detta genom några praktiska exempel samt visar på magin i en gemensam design för alla plattformar. ",
        "eventId": "cadec2018",
        "id": 4,
        "speakers": [
          {
            "id": 4,
            "avatarUrl":
              "https://api.eventlama.com/avatars/events/74/speakers/734/avatar.png",
            "bio": "Stephen is super!",
            "github": "github",
            "name": "Stephen White",
            "twitter": "twitter"
          }
        ],
        "startDate": "2018-01-24 13:00:00 +0000 UTC"
      },
      "5": {
        "title": "Vad är GDPR och varför ska jag bry mig?",
        "description":
          "“Finns det några GDPR-aspekter på det här projektet?” Det är en fråga som hörs allt oftare. GDPR – EU:s dataskyddsförordning – träder i kraft 25 maj 2018, och ersätter då personuppgiftslagen. Genom GDPR vill EU tvinga företag att ta ett helhetsgrepp på frågor som rör behandling av personuppgifter och personlig integritet. Varför ska du som utvecklare/arkitekt behöva bry dig om detta?Vi gör en snabb överflygning av lagstiftningen och tittar på ett antal fall där den kommer att påverka arbetet för oss som sitter med arkitektur och kod. ",
        "eventId": "cadec2018",
        "id": 5,
        "speakers": [
          {
            "id": 5,
            "avatarUrl":
              "https://api.eventlama.com/avatars/events/74/speakers/734/avatar.png",
            "bio": "Björn is great!",
            "github": "github",
            "name": "Björn Genfors",
            "twitter": "twitter"
          }
        ],
        "startDate": "2018-01-24 13:00:00 +0000 UTC"
      },
      "6": {
        "title":
          "Blockkedjan – länken till smarta kontrakt och andra innovativa lösningar",
        "description":
          "Bitcoin beskrivs av vissa som den största innovationen sedan Internet. På senare tid har det dock blivit tydligt att Bitcoin bara är en del i något ännu större, nämligen teknologin som ligger till grund för Bitcoin – blockkedjan. Vi kommer att ge en introduktion till hur blockkedjan fungerar och vilken inverkan tekniken kan ha på den framtida samhällsutvecklingen. Föredraget beskriver också Ethereum, som förutom en Bitcoinliknande blockkedja även erbjuder en plattform (EVM) för distribuerade blockkedjeapplikationer, s.k. DApps eller smarta kontrakt. Avslutningsvis demonstrerar vi praktiskt hur utveckling och användning av smarta kontrakt går till.",
        "eventId": "cadec2018",
        "id": 6,
        "speakers": [
          {
            "id": 6,
            "avatarUrl":
              "https://api.eventlama.com/avatars/events/74/speakers/734/avatar.png",
            "bio": "Pär is great!",
            "github": "github",
            "name": "Pär Wenåker",
            "twitter": "twitter"
          },
          {
            "id": 7,
            "avatarUrl":
              "https://api.eventlama.com/avatars/events/74/speakers/734/avatar.png",
            "bio": "Peter is best!",
            "github": "github",
            "name": "Peter Larsson",
            "twitter": "twitter"
          }
        ],
        "startDate": "2018-01-24 13:00:00 +0000 UTC"
      }
    }
  }
]
